{"class_name": "Model", "config": {"name": "model_180", "layers": [{"name": "input_119", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1316], "dtype": "float32", "sparse": false, "name": "input_119"}, "inbound_nodes": []}, {"name": "input_120", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1316], "dtype": "float32", "sparse": false, "name": "input_120"}, "inbound_nodes": []}, {"name": "dense_542", "class_name": "Dense", "config": {"name": "dense_542", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_119", 0, 0, {}]]]}, {"name": "dense_546", "class_name": "Dense", "config": {"name": "dense_546", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_120", 0, 0, {}]]]}, {"name": "activation_424", "class_name": "Activation", "config": {"name": "activation_424", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_542", 0, 0, {}]]]}, {"name": "activation_428", "class_name": "Activation", "config": {"name": "activation_428", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_546", 0, 0, {}]]]}, {"name": "dropout_424", "class_name": "Dropout", "config": {"name": "dropout_424", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_424", 0, 0, {"training": true}]]]}, {"name": "dropout_428", "class_name": "Dropout", "config": {"name": "dropout_428", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_428", 0, 0, {"training": true}]]]}, {"name": "dense_543", "class_name": "Dense", "config": {"name": "dense_543", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_424", 0, 0, {}]]]}, {"name": "dense_547", "class_name": "Dense", "config": {"name": "dense_547", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_428", 0, 0, {}]]]}, {"name": "activation_425", "class_name": "Activation", "config": {"name": "activation_425", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_543", 0, 0, {}]]]}, {"name": "activation_429", "class_name": "Activation", "config": {"name": "activation_429", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_547", 0, 0, {}]]]}, {"name": "dropout_425", "class_name": "Dropout", "config": {"name": "dropout_425", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_425", 0, 0, {"training": true}]]]}, {"name": "dropout_429", "class_name": "Dropout", "config": {"name": "dropout_429", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_429", 0, 0, {"training": true}]]]}, {"name": "dense_544", "class_name": "Dense", "config": {"name": "dense_544", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_425", 0, 0, {}]]]}, {"name": "dense_548", "class_name": "Dense", "config": {"name": "dense_548", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_429", 0, 0, {}]]]}, {"name": "activation_426", "class_name": "Activation", "config": {"name": "activation_426", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_544", 0, 0, {}]]]}, {"name": "activation_430", "class_name": "Activation", "config": {"name": "activation_430", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_548", 0, 0, {}]]]}, {"name": "dropout_426", "class_name": "Dropout", "config": {"name": "dropout_426", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_426", 0, 0, {"training": true}]]]}, {"name": "dropout_430", "class_name": "Dropout", "config": {"name": "dropout_430", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_430", 0, 0, {"training": true}]]]}, {"name": "dense_545", "class_name": "Dense", "config": {"name": "dense_545", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_426", 0, 0, {}]]]}, {"name": "dense_549", "class_name": "Dense", "config": {"name": "dense_549", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_430", 0, 0, {}]]]}, {"name": "activation_427", "class_name": "Activation", "config": {"name": "activation_427", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_545", 0, 0, {}]]]}, {"name": "activation_431", "class_name": "Activation", "config": {"name": "activation_431", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_549", 0, 0, {}]]]}, {"name": "dropout_427", "class_name": "Dropout", "config": {"name": "dropout_427", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_427", 0, 0, {"training": true}]]]}, {"name": "dropout_431", "class_name": "Dropout", "config": {"name": "dropout_431", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_431", 0, 0, {"training": true}]]]}, {"name": "concatenate_60", "class_name": "Concatenate", "config": {"name": "concatenate_60", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dropout_427", 0, 0, {}], ["dropout_431", 0, 0, {}]]]}, {"name": "dense_550", "class_name": "Dense", "config": {"name": "dense_550", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_60", 0, 0, {}]]]}, {"name": "activation_432", "class_name": "Activation", "config": {"name": "activation_432", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["dense_550", 0, 0, {}]]]}, {"name": "dropout_432", "class_name": "Dropout", "config": {"name": "dropout_432", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_432", 0, 0, {"training": true}]]]}, {"name": "dense_551", "class_name": "Dense", "config": {"name": "dense_551", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_432", 0, 0, {}]]]}, {"name": "dense_552", "class_name": "Dense", "config": {"name": "dense_552", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_551", 0, 0, {}]]]}], "input_layers": [["input_119", 0, 0], ["input_120", 0, 0]], "output_layers": [["dense_552", 0, 0]]}, "keras_version": "2.3.0", "backend": "tensorflow"}